/*************************************************************************
	> File  : fall.c
	> Author:yuhao 
	> Mail  :yu.hao@utt.com.cn 
	> Time  : Fri 17 Mar 2017 10:30:50 AM EDT
    >题目：一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，
    >求它在第10次落地时，共经过多少米？第10次反弹多高？
 ************************************************************************/

#include<stdio.h>
int main()
{
    float s = 100.0;
    float h = s/2;
    int n;
    for(n=2; n<=10; n++)
    {
        s = s + h*2;
        h = h/2;
    }
    printf("第十次落地时共经过%f米，第十次反弹%f米。\n",s,h);
    return 0;
}
